OpenFOAM_Maincode/tutorials/multicomponentFluid/membrane/0/CH4.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include"

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletSleeve
    {
        type            fixedValue;
        value           uniform $!sleeve/CH4;
    }
    inletPipe
    {
        type            fixedValue;
        value           uniform $!pipe/CH4;
    }
    outletSleeve
    {
        type            inletOutlet;
        inletValue      uniform $!sleeve/CH4;
        value           uniform $!sleeve/CH4;
    }
    outletPipe
    {
        type            inletOutlet;
        inletValue      uniform $!pipe/CH4;
        value           uniform $!pipe/CH4;
    }
    wall
    {
        type            zeroGradient;
    }
    membraneSleeve
    {
        type            semiPermeableBaffleMassFraction;
        neighbourPatch  membranePipe;
        c               0.1;
        property        massFraction;
        value           uniform $!sleeve/CH4;
    }
    membranePipe
    {
        type            semiPermeableBaffleMassFraction;
        neighbourPatch  membraneSleeve;
        c               0.1;
        property        massFraction;
        value           uniform $!pipe/CH4;
    }
}


// ************************************************************************* //
